TP2/index.html
<!DOCTYPE html>
<html>
<head>
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>TP2: Clases genéricas y polimorfismo</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Programación II">
<link rel="stylesheet" type="text/css" href="css/org.css">
<link rel="stylesheet" type="text/css" href="css/org-solarized.css">
</head>
<body>
<div id="content">
<h1 class="title">TP2: Clases genéricas y polimorfismo</h1>
<p>
La fecha de entrega de este TP es el <b>16 de junio de 2016</b>. Se puede realizar de
manera individual, o en grupos de a lo sumo dos personas.
</p>

<p>
El TP consta de dos partes, que se entregarán de manera conjunta en un único
ZIP con el código Java, respetando la estructura del proyecto de Eclipse que se
proporciona como parte de la consigna.
</p>

<p>
El proyecto de Eclipse se puede descargar desde <a href="https://github.com/ungs-prog2/tp_2016a/releases">esta página</a>.
</p>

<div id="table-of-contents">
<h2>&Iacute;ndice</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#parte1">Parte 1: Estructuras de datos genéricas</a></li>
<li><a href="#parte2">Parte 2: Polimorfismo y desacoplamiento</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="parte1"><a id="orgheadline5"></a>Parte 1: Estructuras de datos genéricas</h2>
<div class="outline-text-2" id="text-parte1">
<p>
En esta parte se pide implementar un diccionario conforme a una
interfaz pre-determinada, empleando un TAD Conjunto como soporte.
</p>

<p>
Como parte de la consigna <b>se proporciona</b>:
</p>

<ul class="org-ul">
<li>la definición de la <a href="#diccionario">interfaz <i>Diccionario</i></a>.</li>
<li>la implementación de la <a href="#conjunto">clase <i>Conjunto</i></a>.</li>
</ul>

<p>
Y <b>se pide</b>:
</p>

<ul class="org-ul">
<li>la implementación de la clases <a href="#dicc-conjunto"><i>DiccConjunto</i> y <i>TuplaDic</i></a>.</li>
</ul>

<p>
Se incluye también una <a href="#guia1">guía de implementación</a>.
</p>
</div>


<div id="outline-container-orgheadline1" class="outline-3">
<h3 id="diccionario"><a id="orgheadline1"></a>La interfaz <i>Diccionario</i></h3>
<div class="outline-text-3" id="text-diccionario">
<p>
La interfaz pública <i>Diccionario</i> define cinco operaciones con dos tipos
paramétricos (la clave <i>K</i> y el valor <i>V):</i>
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #859900;">public</span> <span style="color: #859900;">interface</span> <span style="color: #b58900;">Diccionario</span>&lt;<span style="color: #b58900;">K</span>, <span style="color: #b58900;">V</span>&gt;
{
    <span style="color: #b58900;">void</span> <span style="color: #268bd2;">guardar</span>(<span style="color: #b58900;">K</span> <span style="color: #268bd2;">clave</span>, <span style="color: #b58900;">V</span> <span style="color: #268bd2;">valor</span>);

    <span style="color: #b58900;">V</span> <span style="color: #268bd2;">obtener</span>(<span style="color: #b58900;">K</span> <span style="color: #268bd2;">clave</span>);

    <span style="color: #b58900;">boolean</span> <span style="color: #268bd2;">pertenece</span>(<span style="color: #b58900;">K</span> <span style="color: #268bd2;">clave</span>);

    <span style="color: #b58900;">void</span> <span style="color: #268bd2;">eliminar</span>(<span style="color: #b58900;">K</span> <span style="color: #268bd2;">clave</span>);

    <span style="color: #b58900;">int</span> <span style="color: #268bd2;">tama&#241;o</span>();
}
</pre>
</div>

<p>
La documentación de cada método se incluye en el archivo <a href="https://github.com/ungs-prog2/tp_2016a/tree/gh-pages/TP2/src/parte1/Diccionario.java">Diccionario.java</a>.
</p>

<p>
No se permite realizar ningún cambio a esta interfaz.
</p>
</div>
</div>


<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="conjunto"><a id="orgheadline2"></a>La clase <i>Conjunto</i></h3>
<div class="outline-text-3" id="text-conjunto">
<p>
Se incluye la implementación de un <i>Conjunto</i> genérico con el tipo paramétrico <i>T</i>
(el tipo del elemento):
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #859900;">class</span> <span style="color: #b58900;">Conjunto</span>&lt;<span style="color: #b58900;">T</span> <span style="color: #859900;">extends</span> <span style="color: #b58900;">Comparable</span>&lt;<span style="color: #b58900;">T</span>&gt;&gt;
{
    <span style="color: #b58900;">void</span> <span style="color: #268bd2;">agregar</span>(<span style="color: #b58900;">T</span> <span style="color: #268bd2;">elem</span>)       { <span style="color: #586e75; font-style: italic;">/* </span><span style="color: #586e75;">ya implementado */</span> }

    <span style="color: #b58900;">boolean</span> <span style="color: #268bd2;">pertenece</span>(<span style="color: #b58900;">T</span> <span style="color: #268bd2;">elem</span>)  { <span style="color: #586e75; font-style: italic;">/* </span><span style="color: #586e75;">ya implementado */</span> }

    <span style="color: #b58900;">void</span> <span style="color: #268bd2;">quitar</span>(<span style="color: #b58900;">T</span> <span style="color: #268bd2;">elem</span>)        { <span style="color: #586e75; font-style: italic;">/* </span><span style="color: #586e75;">ya implementado */</span> }

    <span style="color: #b58900;">T</span> <span style="color: #268bd2;">recuperar</span>(<span style="color: #b58900;">T</span> <span style="color: #268bd2;">elem</span>)        { <span style="color: #586e75; font-style: italic;">/* </span><span style="color: #586e75;">ya implementado */</span> }
}
</pre>
</div>

<p>
De la definición de la clase se deduce que los elementos del conjunto deben ser
<b>comparables entre sí</b>.
</p>

<p>
La documentación de cada método se incluye en el archivo <a href="https://github.com/ungs-prog2/tp_2016a/tree/gh-pages/TP2/src/parte1/Conjunto.java">Conjunto.java</a>.
</p>

<p>
Se proporciona la implementación completa de la clase. No se pueden realizar
alteraciones, ni agregar métodos adicionales. En particular, nótese que, de
manera intencional, este Conjunto no proporciona el método <i>tamaño()</i>.
</p>
</div>
</div>


<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="dicc-conjunto"><a id="orgheadline4"></a><i>DiccConjunto</i> y <i>TuplaDic</i></h3>
<div class="outline-text-3" id="text-dicc-conjunto">
<p>
La clase <i>DiccConjunto</i> debe implementar la interfaz <i>Diccionario</i>
sobre el TAD <i>Conjunto</i>.
</p>

<p>
Como el número de tipos paramétricos difiere entre estas dos clases, será
necesario usar un TAD intermedio que actúe como puente entre <i>Conjunto&lt;T&gt;</i> y
<i>DiccConjunto&lt;K, V&gt;</i>.
</p>

<p>
Se recomienda usar <i>TuplaDic&lt;K, V&gt;</i> como TAD intermedio. Es una tupla de dos
elementos en la que la comparación se realiza solamente por el primero de ellos
(en este caso la clave).
</p>

<p>
Archivos a completar:
</p>

<ul class="org-ul">
<li><a href="https://github.com/ungs-prog2/tp_2016a/tree/gh-pages/TP2/src/parte1/TuplaDic.java">TuplaDic.java</a>: implementar <tt>toString()</tt>, <tt>equals()</tt> y <tt>compareTo()</tt>.</li>

<li><a href="https://github.com/ungs-prog2/tp_2016a/tree/gh-pages/TP2/src/parte1/DiccConjunto.java">DiccConjunto.java</a>: implementar <tt>guardar()</tt>, <tt>obtener()</tt>, <tt>pertenece()</tt> <tt>tamaño()</tt> y
<tt>eliminar()</tt>.</li>
</ul>
</div>

<div id="outline-container-orgheadline3" class="outline-4">
<h4 id="guia1"><a id="orgheadline3"></a>Guía de implementación</h4>
<div class="outline-text-4" id="text-guia1">
<ol class="org-ol">
<li><p>
La idea es emplear un conjunto cuyos elementos sean tuplas
<tt>(clave, significado)</tt>. Es decir, instanciar <b>dentro de
DiccConjunto</b> un conjunto cuyo tipo paramétrico sea <i>TuplaDic&lt;K,
V&gt;</i>. Así:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #2aa198;">/**</span>
<span style="color: #2aa198;"> * Conjunto privado que DiccConjunto usa para almacenar</span>
<span style="color: #2aa198;"> * sus parejas (clave, significado).</span>
<span style="color: #2aa198;"> */</span>
<span style="color: #859900;">private</span> <span style="color: #b58900;">Conjunto</span>&lt;<span style="color: #b58900;">TuplaDic</span>&lt;<span style="color: #b58900;">K</span>, <span style="color: #b58900;">V</span>&gt;&gt; <span style="color: #268bd2;">elementos</span>;
</pre>
</div></li>

<li>Para que esto funcione, el <i>equals()</i> y <i>compareTo()</i> de la tupla
deben fijarse solamente en el primer elemento (la clave). Así,
se puede realizar una búsqueda dentro del conjunto con una
tupla <tt>(clave, null)</tt>.</li>

<li><p>
Como no hay <i>Conjunto.tamaño()</i>, <i>DiccConjunto</i> deberá llevar la
cuenta de su número de elementos. Para ello, necesitará una
variable de instancia <i>numElementos</i> que será incrementada en
<i>guardar()</i> y decrementada en <i>eliminar()</i>.
</p>

<p>
Puede ocurrir, no obstante que un elemento a guardar ya exista,
y por tanto simplemente se reemplace; en ese caso no se debe
incrementar <i>numElementos</i>. Algo similar ocurre con <i>eliminar()</i> y
elementos que no existen.
</p>

<p>
Ambos casos se pueden solucionar usando <i>pertenece()</i> antes de
modificar el valor de <i>numElementos</i>.
</p></li>
</ol>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="parte2"><a id="orgheadline10"></a>Parte 2: Polimorfismo y desacoplamiento</h2>
<div class="outline-text-2" id="text-parte2">
<p>
En esta segunda parte se pide la refactorización de una clase haciendo uso de
polimorfismo como mecanismo para desacoplar componentes.
</p>

<p>
En otras palabras: se tiene una clase con un único método, demasiado largo, que
se desea descomponer en módulos distintos (clases), cada uno de las cuales se
encargue de una pequeña parte de la tarea global.
</p>

<p>
<b>Importante</b>: los cambios a realizar son simplemente de reorganización de código.
Tras los cambios, el comportamiento del programa debe seguir siendo el mismo.
Por ejemplo, los archivos <i>clientes.csv</i> y <i>empleados.json</i> que resultan de
ejecutar <tt>main()</tt> deben resultar idénticos tras los cambios.
</p>
</div>

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6">La clase <i>BDExport</i></h3>
<div class="outline-text-3" id="text-orgheadline6">
<p>
La clase a restructurar se llama <tt>BDExport</tt>, y se ocupa de exportar una lista de
objetos a un archivo, en un determinado formato. Se proporciona una clase <a href="https://github.com/ungs-prog2/tp_2016a/tree/gh-pages/TP2/src/parte2/Main.java">Main</a>
que muestra su uso:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #859900;">public</span> <span style="color: #859900;">static</span> <span style="color: #b58900;">void</span> <span style="color: #268bd2;">main</span>(<span style="color: #b58900;">String</span>[] <span style="color: #268bd2;">args</span>) {
    <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75;">Exportar una lista de clientes a CSV.</span>
    BDExport.export(<span style="color: #2aa198;">"clientes.csv"</span>,
                    <span style="color: #268bd2; font-weight: bold;">Formato</span>.CSV, listaClientes());

    <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75;">Exportar una lista de empleados a JSON.</span>
    BDExport.export(<span style="color: #2aa198;">"empleados.json"</span>,
                    <span style="color: #268bd2; font-weight: bold;">Formato</span>.JSON, listaEmpleados());
}
</pre>
</div>

<p>
Esta es la documentación y la firma del método <tt>export()</tt> ya implementado:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #2aa198;">/**</span>
<span style="color: #2aa198;"> * Exporta una serie de objetos de la base de datos a un archivo.</span>
<span style="color: #2aa198;"> *</span>
<span style="color: #2aa198;"> * Recibe el nombre del archivo, el formato deseado (CSV o JSON),</span>
<span style="color: #2aa198;"> * y la lista de objetos (empleados o clientes).</span>
<span style="color: #2aa198;"> */</span>
<span style="color: #859900;">public</span> <span style="color: #859900;">static</span> <span style="color: #b58900;">void</span> <span style="color: #268bd2;">export</span>(
        <span style="color: #b58900;">String</span> <span style="color: #268bd2;">archivo</span>, <span style="color: #b58900;">Formato</span> <span style="color: #268bd2;">formato</span>, <span style="color: #b58900;">List</span>&lt;?&gt; <span style="color: #268bd2;">objetos</span>)
{
    <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75;">70 l&#237;neas de c&#243;digo para...:</span>
    <span style="color: #586e75; font-style: italic;">//</span>
    <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75;">Abrir el archivo</span>
    <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75;">Determinar el tipo del objeto (!)</span>
    <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75;">Extraer los atributos seg&#250;n la clase a exportar (!)</span>
    <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75;">Exportar a CSV o JSON, con varios switch/if/else combinados (!)</span>
    <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75;">Capturar excepciones e imprimir a System.err (!)</span>
}
</pre>
</div>

<p>
A lo que se quiere llegar es a un código más elegante y extensible que permita,
en el futuro, (a) agregar nuevos formatos y (b) tipos de objetos sin tener que
modificar su código.
</p>

<p>
Ver <a href="https://github.com/ungs-prog2/tp_2016a/tree/gh-pages/TP2/src/parte2/BDExport.java">BDExport.java</a>.
</p>
</div>
</div>


<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7">Sugerencia de diseño</h3>
<div class="outline-text-3" id="text-orgheadline7">
<p>
El diseño de la la solución es libre, pero a continuación se detalla un posible
diseño. El alumno puede decidir seguirlo en su totalidad, o en parte; o
implementar un diseño propio desde cero.
</p>

<p>
En términos generales, Se sugiere el uso de una clase abstracta <i>Exportador</i> (o
cualquier otro nombre) y una interfaz <i>Exportable</i> (ídem) tal que el código de
<tt>export()</tt> quede como sigue:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #859900;">public</span> <span style="color: #859900;">static</span> <span style="color: #b58900;">void</span> <span style="color: #268bd2;">export</span>(<span style="color: #b58900;">Exportador</span> <span style="color: #268bd2;">exporter</span>,
                          <span style="color: #b58900;">Iterable</span>&lt;? <span style="color: #859900;">extends</span> <span style="color: #b58900;">Exportable</span>&gt; <span style="color: #268bd2;">objetos</span>)
{
    <span style="color: #859900;">for</span> (<span style="color: #b58900;">Exportable</span> <span style="color: #268bd2;">e</span> : objetos) {
        <span style="color: #b58900;">Atributos</span> <span style="color: #268bd2;">attrs</span> = e.extraerAttributos();
        exporter.guardarCampos(attrs);
    }
}
</pre>
</div>

<p>
Y la nueva función <tt>main()</tt>:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #859900;">public</span> <span style="color: #859900;">static</span> <span style="color: #b58900;">void</span> <span style="color: #268bd2;">main</span>(<span style="color: #b58900;">String</span>[] <span style="color: #268bd2;">args</span>)
{
    <span style="color: #859900;">try</span> {
        <span style="color: #b58900;">FormatWriter</span> <span style="color: #268bd2;">csv</span> = <span style="color: #859900;">new</span> <span style="color: #b58900;">ExportadorCSV</span>(<span style="color: #2aa198;">"clientes.csv"</span>);
        <span style="color: #b58900;">FormatWriter</span> <span style="color: #268bd2;">json</span> = <span style="color: #859900;">new</span> <span style="color: #b58900;">ExportadorJSON</span>(<span style="color: #2aa198;">"empleados.json"</span>);
        BDExport.export(csv, listaClientes());
        BDExport.export(json, listaEmpleados());
    } <span style="color: #859900;">catch</span> (<span style="color: #b58900;">IOException</span> <span style="color: #268bd2;">e</span>) {
        System.err.println(<span style="color: #2aa198;">"No se pudo realizar la copia de seguridad"</span>);
    }
}
</pre>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-4">
<h4 id="orgheadline8">La interfaz <i>Exportable</i></h4>
<div class="outline-text-4" id="text-orgheadline8">
<p>
En lugar de dejar que <i>BDExport</i> “averigüe” el tipo de cada objeto a exportar, y
extraiga sus atributos con un cast, los propios objetos deberían saber
exportarse a sí mismos.
</p>

<p>
Esto lo pueden conseguir mediante la interfaz sugerida <i>Exportable:</i>
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #859900;">public</span> <span style="color: #859900;">interface</span> <span style="color: #b58900;">Exportable</span>
{
    <span style="color: #2aa198;">/**</span>
<span style="color: #2aa198;">     * Devuelve los atributos de la instancia en un diccionario.</span>
<span style="color: #2aa198;">     *</span>
<span style="color: #2aa198;">     * En esta versi&#243;n simplificada, los valores siempre son</span>
<span style="color: #2aa198;">     * strings (ver clase Atributos).</span>
<span style="color: #2aa198;">     */</span>
    <span style="color: #b58900;">Atributos</span> <span style="color: #268bd2;">extraerAttributos</span>();
}
</pre>
</div>

<p>
Así, se deberían modificar las clases <a href="https://github.com/ungs-prog2/tp_2016a/tree/gh-pages/TP2/src/parte2/Cliente.java">Cliente</a> y <a href="https://github.com/ungs-prog2/tp_2016a/tree/gh-pages/TP2/src/parte2/Empleado.java">Empleado</a> para que implementen
esta interfaz.
</p>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9">La clase <i>Exportador</i> y sus subclases</h4>
<div class="outline-text-4" id="text-orgheadline9">
<p>
La clase abstracta <i>Exportador</i> abstrae el concepto de serializar, en cualquier
formato, los atributos de un objeto:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #859900;">public</span> <span style="color: #859900;">abstract</span> <span style="color: #859900;">class</span> <span style="color: #b58900;">Exportador</span>
{
    <span style="color: #859900;">public</span> <span style="color: #859900;">abstract</span> <span style="color: #b58900;">void</span> <span style="color: #268bd2;">guardarCampos</span>(<span style="color: #b58900;">Atributos</span> <span style="color: #268bd2;">attrs</span>);
}
</pre>
</div>

<p>
De aquí se pueden derivar los exportadores para CSV y JSON.
</p>

<p>
También se puede valorar introducir una clase abstracta intermedia,
<i>ExportadorArchivo</i>, que contenga el código común para la apertura de archivos
(usado por ambos exportadores).
</p>

<p>
<b>Nota final</b>: <tt>export()</tt> ya contiene el código para exportar a CSV y JSON. No es
necesario, por tanto, saber implementar estos formatos, pero se puede obtener
una noción general consultando, por ejemplo, Wikipedia: <a href="https://es.wikipedia.org/wiki/CSV">CSV</a>, <a href="https://es.wikipedia.org/wiki/JSON#Ejemplo_de_JSON">JSON</a>.
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
